CNBlackJ/iot-lesson/esp8266/fpv_car.cpp
#define BLYNK_PRINT Serial 
#include <ESP8266WiFi.h> 
#include <BlynkSimpleEsp8266.h> 
#include <Servo.h>
 
 
// You should get Auth Token in the Blynk App. 
// Go to the Project Settings (nut icon). 
char auth[] = "b25846ffa649429fac7f6b28ab524adc"; 
 
 
// Your WiFi credentials. 
// Set password to "" for open networks. 
char ssid[] = "GrowthAI.tech"; 
char pass[] = "GrowthAI"; 
 
 
 
int PWMA=5;//Right side 
int PWMB=4;//Left side 
int DA=0;//Right reverse 
int DB=2;//Left reverse 

Servo servoX;
Servo servoY;
 
 
void setup(){ 
  // Debug console 
  Serial.begin(9600); 
  Blynk.begin(auth, ssid, pass); 
  pinMode(PWMA, OUTPUT); 
  pinMode(PWMB, OUTPUT); 
  pinMode(DA, OUTPUT); 
  pinMode(DB, OUTPUT); 
  servoX.attach(3);
  servoX.attach(6);
} 
 
 
 
void loop(){ 
  Blynk.run(); 
} 


BLYNK_WRITE(V2){
  int servo_x = param[0].asInt(); 
  int servo_y = param[1].asInt();
  servoX.write(servo_x);
  servoY.write(servo_x);
}
 
 
// Handling Joystick data 
BLYNK_WRITE(V1){ 
  int x = param[0].asInt(); 
  int y = param[1].asInt();  
  
  if(x==-1 && y==-1){             //BackWard and Left     
    digitalWrite(PWMA, LOW); 
    digitalWrite(DA, LOW); 
       
    digitalWrite(PWMB, HIGH); 
    digitalWrite(DB, HIGH); 
   
  }else if(x==-1 && y==0){        //Left Turn 
    digitalWrite(PWMA, 450); 
    digitalWrite(DA, HIGH); 
      
    digitalWrite(PWMB, 450); 
    digitalWrite(DB, LOW); 
   
  }else if(x==-1 && y==1){        //Forward and Left     
    digitalWrite(PWMA, LOW); 
    digitalWrite(DA, LOW); 
      
    digitalWrite(PWMB, HIGH); 
    digitalWrite(DB, LOW); 
   
  }else if(x==0 && y==-1){        //BackWard     
    digitalWrite(PWMA, HIGH); 
    digitalWrite(DA, HIGH); 
       
    digitalWrite(PWMB, HIGH); 
    digitalWrite(DB, HIGH);
  }else if(x==0 && y==0){        //Stay 
    digitalWrite(PWMA, LOW); 
    digitalWrite(DA, LOW); 
       
    digitalWrite(PWMB, LOW); 
    digitalWrite(DB, LOW); 
   
  }else if(x==0 && y==1){        //Forward 
    digitalWrite(PWMA, HIGH); 
    digitalWrite(DA, LOW); 
      
    digitalWrite(PWMB, HIGH); 
    digitalWrite(DB, LOW); 
   
  }else if(x==1 && y==-1){        //Backward and Right     
    digitalWrite(PWMA, HIGH); 
    digitalWrite(DA, HIGH); 
       
    digitalWrite(PWMB, LOW); 
    digitalWrite(DB, LOW); 
   
  }else if(x==1 && y==0){        //Right turn 
     digitalWrite(PWMA, 450); 
    digitalWrite(DA, LOW); 
     
    digitalWrite(PWMB, 450); 
    digitalWrite(DB, HIGH); 
   
  }else if(x==1 && y==1){        //Forward and Right 
    digitalWrite(PWMA, HIGH); 
    digitalWrite(DA, LOW); 
     
    digitalWrite(PWMB, LOW); 
    digitalWrite(DB, LOW);
   } 
}  
